{"text":[
    "In thermodynamics, heat is defined as the form of energy crossing the boundary of a thermodynamic system by virtue of a temperature difference across the boundary.[1] A thermodynamic system does not contain heat. Nevertheless, the term is also often used to refer to the thermal energy contained in a system as a component of its internal energy and that is reflected in the temperature of the system. For both uses of the term, heat is a form of energy.",
    "An example of formal vs. informal usage may be obtained from the right-hand photo, in which the metal bar is 'conducting heat' from its hot end to its cold end, but if the metal bar is considered a thermodynamic system, then the energy flowing within the metal bar is called internal energy, not heat. The hot metal bar is also transferring heat to its surroundings, a correct statement for both the strict and loose meanings of heat. Another example of informal usage is the term heat content, used despite the fact that physics defines heat as energy transfer. More accurately, it is thermal energy that is contained in the system or body, as it is stored in the microscopic degrees of freedom of the modes of vibration.[2]",
    "Heat is energy in transfer to or from a thermodynamic system, by a mechanism that involves the microscopic atomic modes of motion or the corresponding macroscopic properties.[3] This descriptive characterization excludes the transfers of energy by thermodynamic work or mass transfer. Defined quantitatively, the heat involved in a process is the difference in internal energy between the final and initial states of a system, and subtracting the work done in the process.[4] This is the formulation of the first law of thermodynamics.",
    "The measurement of energy transferred as heat is called calorimetry, performed by measuring its effect on the states of interacting bodies. For example, heat can be measured by the amount of ice melted, or by change in temperature of a body in the surroundings of the system.[5]",
    "In the International System of Units (SI) the unit of measurement for heat, as a form of energy, is the joule (J)."
  ]}